[{
  "_id": {
    "$oid": "6718e5b2befe020ce67a1b3e"
  },
  "topicName": "Lord of the rings!",
  "createdByUser": "671760610b77053a43c42990",
  "messages": [
    "isacsson_89@hotmail.com: BOY!",
    "mums@mail.com: Say what!",
    "isacsson_89@hotmail.com: Hello!",
    "mums@mail.com: mums!",
    "AI: {\r\n    \"content\": \"Hej\"\r\n}",
    "AI: Hej\r\n",
    "AI: Hej",
    "AI: I am a bot, I don't know the answer to that question",
    "AI: jag är dum!",
    "AI: jag är dum!",
    "AI: jag är dum!",
    "AI: jag är dum!",
    "AI: jag är dum!",
    "AI: jag är dum!",
    "AI: jag är dum!",
    "AI: Sveriges huvudstad är Stockholm.",
    "AI: Jag är en AI-assistent utvecklad av OpenAI och bygger på GPT-3.5-arkitekturen. Tekniken bakom mig har utvecklats och förbättrats över flera år, men den exakta modellen som driver mina svar blev tillgänglig i mars 2023. Har du fler frågor eller något specifikt ämne du vill veta mer om?",
    "AI: Ah, dear traveler! In the grand tales of Middle-earth, Gimli, son of Glóin, stands stalwart and wise. By the time of the great Fellowship's formation, he hath seen 139 years pass, a sprightly age for a Dwarf! Aye, stout of heart and mighty in battle, he marches alongside Elves and Men. Wouldst thou inquire more of this noble son of Durin?",
    "AI: Ah, a query most intriguing, akin to the lore of Middle-earth itself! Legolas, son of Thranduil, is an Elf of the Woodland Realm, and his years are many, though oft unspoken in precise number. In the tales of the Third Age, he may be youthfully accounted, yet his age could span several centuries, even nearing a millennium. Alas, Elven-kind do not mark their years as Men do, for they are ageless and timeless, as the stars in the night sky!",
    "AI: Ah, Legolas of the Woodland Realm! A fine Elf of the Eldar, he is. Though the exact number of years he has wandered upon Middle-earth is not written in the Red Book, it is whispered amongst the wise that he is over 500, perhaps nearer to 2,000 springs. A mere glimmer in the eternal light of the Elves! Truly a child among his kin, yet a sage to the race of Men. Mayhap even Gandalf himself would chuckle and say, \"Age is but a tale told by the stars.\"",
    "AI: Ah, young traveler, in the realm of Middle-earth, Aragorn, son of Arathorn, is no mere mortal of short years. As of the great War of the Ring, he has seen 87 winters. Long has he wandered the wilds as a Ranger, guided by wisdom and the whispers of destiny!",
    "AI: Ah, curious traveler, you seek the age of the Ents, those ancient shepherds of the forest. In the time before the sun and moon, when the world was young and the trees were but saplings, the Entwives tended the groves and Ents walked the woods. Their years are uncounted, stretching back to the Elder Days. Remember, young hobbits might count their birthdays, but for Ents, the stories are more aged than the Shire itself! So, in short, they are as old as Middle-earth remembers. Keep your feet on the path and your heart filled with song!",
    "AI: Ah, gentle traveler of Middle-earth, I see thou art inquiring about the great tomes of adventure penned by the venerable J.R.R. Tolkien! There are three volumes in \"The Lord of the Rings\" saga: *The Fellowship of the Ring*, *The Two Towers*, and *The Return of the King*. But do not overlook *The Hobbit*, where the journey first begins! Four tales of epic quests await thee, each one a precious gem, much like the One Ring itself.",
    "AI: Ah, my dear traveler of Middle-earth! Thou seekest knowledge of the grand tales woven in the fires of cinema? Verily, there are six epic films that unfurl the legend of Tolkien's world. Three are of the “Lord of the Rings” saga, and three recount the adventures in “The Hobbit.” May these films guide your journey with courage and wisdom! 🚶‍♂️🗡️📜",
    "AI: Verily, noble traveler of Middle-earth, the number of games stretches far and wide like the rolling hills of the Shire! Not easily counted, they are; a fellowship of adventures in worlds beyond. Seek, and thou shalt find many a quest to undertake!",
    "AI: Ah, dear traveler, in the realm of Middle-earth, 'tis known that orcs are creatures molded by malice and shadow. Their hearts hold little kindness, for they were twisted by dark sorcery in ages past. Yet, amidst the shadow, the sun may shine on the unlikeliest of spirits, revealing flickers of change. But beware! To find such a heart among orcs is as rare as mithril in the mountains. Proceed with caution and keep your wits about you!",
    "AI: Ah, noble seeker of Elven lore! In Middle-earth, the Elves are a sundry folk, their full count known only to the wise. Yet, within the realms of Rivendell, Lothlórien, and the Grey Havens, their fair numbers dwindle as the Ages pass. Alas, they are not as populous as Men or Dwarves. Seek not a number, but the beauty of each immortal soul, for that is where their true magic lies! Now, let us away to other matters of Middle-earth!",
    "AI: Ah, noble seeker of tales, at Helm's Deep there gathered a fearsome host of ten thousand orcs, driven by the malice of Saruman. A multitude of darkness they were, eager to lay waste to the fortress of Rohan. But despair not, for valor and courage shone brighter than the darkest night! 🍃✨",
    "AI: Ah, friend, the dark night of Helm's Deep was beset by a great swarm, a fearsome horde of ten thousand Uruk-hai! Out of the shadows they marched, Saruman's foul army intent on breaking the free peoples of Middle-earth. But fear not, for hope kindles even in the darkest hour! 🏹🏰",
    "AI: Ah, friend, in the shadowed annals of Helm's Deep, it is said that ten thousand strong was the horde of Saruman. A tide of malice and darkness they were, but fear not, for courage and hope oft shine brightest when all seems lost! Ready your sword and stand with valor, as did those who faced the storm! 🗡️🌄",
    "AI: Ah, noble seeker of Middle-earth's tidings, at Helm's Deep did the forces of darkness gather in great multitude! It is said that Saruman unleashed an army of ten thousand orcs upon the valiant defenders of Rohan. Their numbers were vast, akin to a shadow stretching over the land, but fear not—for valor and courage know no bounds!",
    "AI: Ah, traveler of distant lands! In the grand tome known as \"The Fellowship of the Ring,\" penned by the valiant scribe J.R.R. Tolkien, you shall find that the number of pages may vary with the printing and edition. Yet, oft it is around 400 to 500 pages where the tale begins, weaving the journey from the Shire to the halls of Rivendell and beyond. May your quest for knowledge be as fulfilling as Frodo's journey though Middle-earth!",
    "AI: Ah, weary traveler, thou seekest knowledge of \"The Two Towers,\" the second tome in the epic saga of Middle-earth! Know this, its pages number oft around 400, yet may vary depending on the tome's edition. Safe travels on thy quest for literary adventure!",
    "AI: Ah, noble traveler! The second tome of the great tale, known as \"The Two Towers,\" boasts a weighty collection of pages. Though the count may vary depending on the edition one possesses, it generally holds around 352 leaves of adventure and peril. May your journey through its words be as thrilling as the quests of the Fellowship!",
    "AI: Ah, weary traveler, thou seekest the number of pages in \"The Return of the King,\" the third tome of our enchanting tale? Verily, the count doth vary depending upon the publishing realm and edition one possesseth. Yet, one might find it to be around 400 to 500 pages. May thy journey through Middle-earth be ever wondrous and swift!",
    "AI: Ah, in the fair realm of Middle-earth, love's light shines in many forms, as varied as the stars above Rivendell. While the tales we hear oft speak of great quests and battles, know that hearts, much like the lands of the Shire, are rich and diverse. So, with a merry twinkle in the eye, one might say: Yes, indeed, amidst elves, dwarves, and men, love knows no bounds, and it blooms where it will, like elanor upon the slopes of Lothlórien!",
    "AI: Ah, dear traveler of Middle-earth, the lands are vast and filled with tales both spoken and unspoken. In the Shire, Rivendell, and beyond, hearts find companionship in many forms—yet love's stories often whisper rather than shout. Seek and ye shall discover bonds as enduring as the One Ring's allure! May your quest for understanding be ever enlightening. 🌿",
    "mums@mail.com: mums!",
    "AI: Ah, young traveler, in the realm of Middle-earth, the age of Legolas, son of Thranduil, is cloaked in the mists of time. Elves are wont to measure not their years as mortals do. Yet, it is whispered amongst elves and men alike that he was born in the woodlands of the Third Age, making him over two thousand years when the Fellowship embarked on their quest. Aye, he is youthful amongst the Eldar, yet venerable to the eyes of mortals!",
    "mums@mail.com: Hey bot how old is legolas?",
    "AI: Ah, Legolas, the keen-eyed prince of the Woodland Realm! In the lore of Middle-earth, during the time of the War of the Ring, he is said to be over 2,900 years old. A mere youth by Elven standards, yet filled with wisdom and grace! Would you like to know more of his noble deeds, my friend?",
    "AI: Ah, traveler of Middle-earth, if thou seekest the age of Gimli, son of Glóin, know this: by the time of the great quest to destroy the One Ring, Gimli stood at a robust 139 years of age, a sprightly youth among the enduring folk of Durin's line! May his beard grow ever longer!",
    "isacsson_89@hotmail.com: how old is gimli?",
    "AI: Ah, noble seeker of tales! At Helm's Deep, the moonless night was stained with the black tide of Saruman’s orcs, numbering ten thousand fierce and foul. Mayhap more, for they came in such multitude that even ancient trees trembled in their roots. But fear not! For hope, like a hidden flame, burned brightest in that darkest hour. 🌿✨",
    "mums@mail.com: how many orcs in battle of helms deep?",
    "AI: Ah, young hobbit, at the Battle of Helm’s Deep, the Uruk-hai were legion, their numbers vast as the stars above. It is said that ten thousand strong they were, marching under Saruman’s dark banner. A formidable force, yet not enough to quench the valor of men and the strength of dwarves and elves united. Keep thy courage, for hope oft springs eternal!",
    "mums@mail.com: how many orcs in battle of helms deep?",
    "AI: Ah, the battle of Helm's Deep, a fierce and storm-laden night it was! Verily, the forces of Saruman did besiege the Hornburg with legions aplenty. It is said that ten thousand strong were mustered—an endless tide of malice and mischief! Brace thyself, for to face such a horde required the stoutest of hearts and the most gallant of allies.",
    "mums@mail.com: how many orcs in battle of helms deep?",
    "AI: Hark! In the grand tale of Helm's Deep, it is said that Saruman unleashed a fearsome host, numbering ten thousand strong, of vile orcs and Uruk-hai. A dark tide they were, like a storm upon the fortress walls. Yet, against such odds, hope and valor stood firm!",
    "isacsson_89@hotmail.com: how many orcs in battle of helms deep?",
    "AI: Ah, the Battle of Helm's Deep, a night to remember! It was said that Saruman's foul army numbered ten thousand strong, a sea of orcs and Uruk-hai, driven by malice and the madness of war. Yet fear not, for even such dark tide could not extinguish the flame of hope and valor that burned bright in the hearts of Men and Elves that night! Adventure and daring deeds aplenty it was!",
    "mums@mail.com: how many orcs in battle of helms deep?",
    "AI: Verily, good traveler, one must know that the Shire is not a place where elves dwell in great numbers. Rarely do they roam its rolling hills, for their hearts belong to forests deep and towers tall. Yet, from time to time, an elven foot might grace its paths, like a fleeting whisper of the ancient songs. So, the count is fleeting, as ephemeral as their presence.",
    "mums@mail.com: How many elfs in the shire?",
    "isacsson_89@hotmail.com: Yeah!",
    "AI: Ah, noble seeker of tales from the realm of Middle-earth! At the great Battle of Helm's Deep, it is said that Saruman's foul army, numbering ten thousand strong, did assail the fortress. Orcs there were aplenty, along with Uruk-hai of grim visage, a formidable horde under the dark banners of the White Hand. Yet fear not, for valor and courage stood firm that day!",
    "AI: Ah, traveler of curious mind, Middle-earth is as ancient as the songs of the Elves and the tales of the old. It was wrought by the hands of the Ainur at the dawn of time, long before the rising of the Sun and Moon. Age upon age has passed, and its history stretches back over many thousands upon thousands of years. May your journey through its timeless lands be ever wondrous!",
    "AI: In the land of Middle-earth, young adventurer, there are many races that walk upon its ancient soil! To name a few: the noble Elves with their timeless grace, the stout Dwarves from their mountain halls, the courageous Men with hearts of valor, the playful Hobbits dwelling in the Shire, the mysterious Ents guarding their forests, and the cunning Orcs born of shadow. Each race with its own tale, its own quest! Seek ye knowledge, and discover more on your journey!",
    "mums@mail.com: how many races?",
    "AI: Verily, in the realm of Middle-earth, there be many races wandering the lands! Amongst them, the noble Elves, stout-hearted Dwarves, steadfast Men, curious Hobbits, ancient Ents, and cunning Orcs, to name but a few. Each with their own tales and destinies woven into the grand tapestry of the world. What quest dost thou seek among them?",
    "mums@mail.com: how many races?",
    "AI: Ah, brave seeker of tales untold! In the land of Mordor, where shadows lie, 'tis Frodo Baggins, the stout-hearted Hobbit of the Shire, who bears the burden and casts the One Ring into the fiery chasm of Mount Doom, aided by his loyal companion, Samwise Gamgee and guided by the wisdom of Gandalf. A deed sung in ages yet to come!",
    "mums@mail.com: who throws the ring in mordor?",
    "isacsson_89@hotmail.com: Hey bot who helps frodo?",
    "AI: Verily, brave Frodo of the Shire finds aid in many a noble heart! Stalwart Samwise Gamgee, ever loyal and true, walketh beside him through shadow and light. In council and wisdom, Gandalf the Grey, guider of paths, lendeth his strength. And let us not forget Aragorn, son of Arathorn, and the fellowship grand, who stand by him against the darkness. Their courage and camaraderie be Frodo’s shield against the encroaching night! ✨",
    "AI bot: Ah, dear traveler, Frodo Baggins, bearer of burdens most dire, departeth the Shire at the ripe age of fifty! An age seasoned yet sprightly for adventures grand and perilous! Wouldst thou embark on such a fateful journey? 🍃✨",
    "mums@mail.com: Hey bot How come the movies are badass?",
    "AI bot: Ah, dear traveler, thou hast posed a query of great allure! Much like the legendary tales of Middle-earth, the movies hold an enchantment wrought by the hands of masterful craftsmen: directors who wield their vision as Gandalf wields his staff, actors with the courage of Aragorn, and a score that echoes the whispers of ancient Elven songs. The fellowship of cinema, bound by the One Ring of creativity, brings forth an adventure most splendid, capturing the hearts of all who dare watch!",
    "isacsson_89@hotmail.com: Hey bot is sam important?",
    "AI bot: Verily, dear friend, Samwise Gamgee is of utmost importance! Just as the smallest acorn can grow into the mightiest oak, so too does Sam's heart shine brightly in the darkest of times. Without faithful Sam, even the grandest of quests might wither and fail. Indeed, he is the steadfast companion every hero needs!",
    "AI bot: Ah, the age of Aragorn, son of Arathorn, heir of Isildur, you seek! At the time of the great War of the Ring, Aragorn, known also as Strider to some, was but 87 years of age. A mere blink for a Dúnedain, for the blood of Númenor flows strong within him! Fare well on your quest for knowledge, brave seeker!",
    "isacsson_89@hotmail.com: Hey bot how old is gandalf?",
    "AI bot: Ah, you seek the wisdom of the ages about the Grey Pilgrim, do you? Gandalf, known in Elvish as Mithrandir, roams Middle-earth with many secrets. In the reckoning of Men, he has walked this world for over two millennia, yet his true origins trace back to the timeless lands, an age beyond the count of years. Indeed, he is as old as legends themselves!",
    "AI bot: Ah, dear traveler, heed the tales of the Dwarves! Gimli, son of Glóin, was born in the year 2879 of the Third Age. During the Great Council of the Ring, he stood at the robust age of 139! But remember, for a Dwarf, such age is but the prime of youth! May your curiosity be ever sated, as the morning Sun greets the Shire. 🌄",
    "mums@mail.com: hej!",
    "isacsson_89@hotmail.com: Hej!",
    "mums@mail.com: Hey bot how much does the first movie cost to produce?",
    "AI bot: Ah, dear traveler, the crafting of \"The Fellowship of the Ring,\" that grand tale, took a bounty of gold indeed. It is said by the sages that the cost was around $93 million of your modern coin! A small price for an epic to echo through the ages, don't you think?",
    "mums@mail.com: Hello!",
    "mums@mail.com: Hey bot how old i boromir when he dies?",
    "AI bot: Ah, traveler from lands unknown, thou seekest the tale of noble Boromir, Son of Denethor, Captain of the White Tower! At his passing, in the year of his greatest trial, Boromir was nigh 41 years of age. A hero's age for a hero's end, as the river bore him gently to the sea. May the stars shine ever on his path!",
    "AI bot: Ah, dear traveler, thou seekest knowledge of distant lands! The capital of Sweden, that fair northern realm, is none other than Stockholm, a city where the waters meet the stones. May your journey be light and your heart ever brave!",
    "mums@mail.com: what!!",
    "AI bot: Ah, young traveler, Legolas of the Woodland Realm, son of Thranduil, is indeed a mighty Elf whose age is counted in centuries rather than years. Though his exact years are not plainly spoken of in the great tales, it is said that he is over 2,000 years old, yet forever youthful in both spirit and visage. Ever shall he be swift of foot and keen of sight, a true prince among the Elves!",
    "isacsson_89@hotmail.com: HI!",
    "isacsson_89@hotmail.com: Hey bot how old can a orc be?",
    "AI bot: Ah, traveler, thou asketh about the wretched orc-kind! In the shadowed lands, these foul creatures oft do not tarry to great age, for their lives are full of strife and battle. Yet, should they escape the sword's edge, an orc may linger for many decades, perhaps a century or so. But heed this: in the lands of Middle-earth, rare it is to find one not claimed by fang or blade long ere such years are reached!",
    "AI bot: Ah, fair traveler, in the realm of Sweden, nestled far to the north amidst fjords and forests echoing with ancient songs, there dwell approximately 10 million souls. Much like the denizens of Middle-earth, they cherish their homesteads and craft their lore among icy winds and shimmering Aurora, blending wisdom of old with the tales yet to be told. May your path be ever clear, and your burdens light!",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "AI bot: Ah, dear traveler, in the realm of Middle-earth, an Elf's years are woven with the threads of eternity. Immortal they are, ageless unless by sorrow or wound they depart these lands. So vast are their lifespans that the count of their years is but a gentle whisper in the winds of time. Elves, like the stars, endure beyond the reckonings of Men. 🌿✨",
    "AI bot: Ah, dear traveler, in the grand tale of Middle-earth, Samwise Gamgee's age was but thirty-nine when he stood brave and true upon the fiery brink of Mount Doom. A worthy age for such a noble heart in service of Frodo and the fate of all free folk!",
    "isacsson_89@hotmail.com: hi!",
    "AI bot: Ah, a question of great import! 'Twas none other than the brave and noble Frodo Baggins who bore the One Ring to the fiery chasm of Mount Doom. Yet, in the end, it was Gollum, driven by avarice and madness, who tumbled into the flames, taking the cursed band with him. Thus ended the Dark Lord's reign, by a twist of fate most curious! Verily, an unexpected turn of events in the land of Middle-earth!",
    "AI bot: Verily, Frodo's truest companion is Samwise Gamgee, stout of heart and ever loyal. Through shadow and flame, Samwise stands by Frodo, a stalwart friend in darkest hour. Such bonds are forged in the fires of friendship, precious beyond measure!",
    "isacsson_89@hotmail.com: dassda",
    "isacsson_89@hotmail.com: d",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: sda",
    "isacsson_89@hotmail.com: d",
    "isacsson_89@hotmail.com: wadw",
    "isacsson_89@hotmail.com: dawdaw",
    "isacsson_89@hotmail.com: wadawwa",
    "isacsson_89@hotmail.com: Hey bot who is sam?",
    "AI bot: Ah, Samwise Gamgee, stout-hearted companion of Frodo Baggins! Loyal gardener and friend, bearer of pots and pans, who journeyed to the fiery grasp of Mount Doom. A hobbit of the Shire with courage aplenty, whose tale is sung in the halls of Rivendell and beyond!",
    "isacsson_89@hotmail.com: ok",
    "isacsson_89@hotmail.com: asdasd",
    "isacsson_89@hotmail.com: sda",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: sdasda",
    "isacsson_89@hotmail.com: ",
    "isacsson_89@hotmail.com: d",
    "isacsson_89@hotmail.com: Oki",
    "isacsson_89@hotmail.com: Hey bot who is saruman?",
    "AI bot: Ah, Saruman! In the grand tales of Middle-earth, he is known as Saruman the White, chief of the wizards and leader of the White Council. Once a wise and noble Maia, he walked the high paths of wisdom. Yet, alas, his heart turned toward shadow and flame, consumed by a lust for power. A servant of the Enemy he became, weaving treachery in his lofty tower of Orthanc. Beware his forked tongue and envy, for they are as perilous as the Dark Lord himself!",
    "isacsson_89@hotmail.com: Hey bot who is Sauron?",
    "AI bot: Ah, a dark query you pose! Sauron, he is the Deceiver, the Dark Lord of Mordor, once the lieutenant of Morgoth himself. In the fires of Mount Doom, he forged the One Ring to rule all others. Ever does he seek dominion over Middle-earth, his eye ever watchful. Beware, for his shadow grows long!",
    "isacsson_89@hotmail.com: ",
    "AI bot: In the fair tongue of Middle-earth, I say unto thee: Lo, at Helm’s Deep, the dark tide did surge with ten thousand orcish fiends, as Saruman's wickedness unleashed its fury upon the valiant men of Rohan! Yet, fear not, for the valor of men and the might of Elves stood defiant, a beacon of hope amidst the shadow! 🌿⚔️",
    "isacsson_89@hotmail.com: he",
    "AI bot: Ah, dear traveler, 'tis Samwise Gamgee of whom you speak! Stalwart hobbit of the Shire, companion to Frodo Baggins. With a heart stout and courage grand, he bore the fate of Middle-earth upon his shoulders alongside his master. Faithful friend, gardener of renown, and a hero in his own right. Verily, without Sam, the quest might've fallen to shadow!",
    "AI bot: Verily, like the One Ring itself, importance lies not in size or stature but in the impact upon the fate of Middle-earth. Seek ye wisdom beyond appearances, for even the smallest person can change the course of the future.",
    "AI bot: Ah, dear traveler, in this grand quest fraught with peril and hope, it is Gandalf the Grey, wise and watchful, who lends his aid. Alongside him are the stalwart fellowship: Aragorn, heir to the throne of Gondor; Legolas of the Woodland Realm; Gimli, son of Glóin; and the faithful Hobbits, steadfast in heart. Together they stand, bound by fate and friendship, against the gathering darkness.",
    "isacsson_89@hotmail.com: Hi",
    "AI bot: Ah, Frodo Baggins, dear traveler! A brave hobbit of the Shire, bearer of the One Ring, and nephew to the esteemed Bilbo. With courage stout and heart pure, he journeyed forth to Mount Doom, tasked with the burden of saving Middle-earth from shadow's grasp. A true hero of our age!",
    "AI bot: Ah, young seeker of wisdom! Samwise Gamgee, ever loyal and stout of heart, is the steadfast companion to Frodo Baggins. A gardener of the Shire, he is, yet his bravery and friendship grow mightier than the tallest of Ents. With pots, pans, and courage unmatched, he journeys far beyond the fields he knows, proving that even the smallest of folk can alter the course of the future. What say you, good traveler, are you inspired by his tale?",
    "love@mail.se: Hey bot how many orcs in battle of helms deep?",
    "AI bot: Ah, noble traveler, the Battle of Helm's Deep! A tale of courage and valor. As the moon lit the night, Saruman's foul horde, numbering ten thousand strong, did descend upon the stout fortress of the Rohirrim. Aye, a sea of orcs and Uruk-hai clashed against the mighty walls, but fear not, for the courage of men, elves, and one steadfast dwarf prevailed!",
    "love@mail.se: Hey bot how many did legolas slay?",
    "AI bot: Ah, noble seeker of tales from the land of Middle-earth! In the grand battle before the gates of Helm's Deep, Legolas, the keen-eyed Elf of the Woodland Realm, counted a tally of 42 foes smitten by his arrow and blade. Yet, beware! For even as the battle raged on, the tallying between Legolas and the stalwart Dwarf, Gimli, continued with great fervor. Ever they strove in friendly contest, and much merriment was had amidst the dire struggle. Mayhap another query stirs in thine heart?",
    "love@mail.se: And how many did gimli slay?",
    "love@mail.se: Hey bot And how many did gimli slay?",
    "AI bot: Ah, a fine query, traveler! In the grand battle before the gates of Helm's Deep, stout-hearted Gimli, son of Glóin, did proclaim with great pride, after the fierce clash, that his tally reached a grand thirty-nine! 'Twas a contest of friendly rivalry with Legolas, you see. Ever a delight in times of darkness!",
    "Dennis@mail.se: HI!",
    "Dennis@mail.se: Hey bot who is the author?",
    "AI bot: Ah, noble traveler! The grand tales of Middle-earth, entwined with valor and mystery, were wrought by the esteemed hand of J.R.R. Tolkien, a loremaster of great renown. His words crafted worlds where hobbits, elves, and men embarked on epic quests. May his stories ever illuminate your path!",
    "Dennis@mail.se: Hey bot who is sam?",
    "AI bot: Ah, Samwise Gamgee! A stalwart hobbit of the Shire he is, faithful companion to Frodo Baggins on the perilous quest to Mount Doom. His heart is as steadfast as the roots of ancient trees, and his loyalty, a beacon of hope in the darkness. \"For what are we holding onto, Sam?\" one might ask. And Sam would declare, \"That there’s some good in this world, Mr. Frodo, and it’s worth fighting for!\" A true hero of Middle-earth, indeed!"
  ],
  "usersInTopic": [
    {
      "_id": {
        "$oid": "671760610b77053a43c42990"
      },
      "email": "mums@mail.com",
      "password": "$2a$10$VYWKmD2O0EvjFCXO1LgsheWazwf4qYzyrePz2/19y46qerKGEfdzC",
      "isAdmin": false,
      "isBanned": false
    },
    {
      "_id": {
        "$oid": "671102adcd40bd52a9242ca8"
      },
      "email": "isacsson_89@hotmail.com",
      "password": "$2a$10$k9xYhNsOoUPgDhccwxQPdeu/hqXcsgliGegesbmb4T/NcMRTZLx6a",
      "isAdmin": false,
      "isBanned": false
    },
    {
      "_id": {
        "$oid": "6721eb4315138100598158ae"
      },
      "email": "love@mail.se",
      "password": "$2a$10$Xa4rp8BxNx5XkchecKoyvei94rBcDkXKlW7OzK2DRRTVk7ZFM12kq",
      "isAdmin": false,
      "isBanned": false
    }
  ],
  "_class": "com.AskABot.AskABot.model.Topic"
},
{
  "_id": {
    "$oid": "6721eb5415138100598158af"
  },
  "topicName": "Top gear",
  "createdByUser": "6721eb4315138100598158ae",
  "messages": [
    "love@mail.se: HI!",
    "love@mail.se: Hey bot which car is the most expensive they tested?",
    "AI bot: Ladies and gentlemen, hold onto your steering wheels! The priciest piece of automotive art that graced the Top Gear track was none other than the mesmerizing Bugatti Veyron Super Sport. It’s faster than a cheetah on a skateboard and, quite frankly, costs as much as a small island. More speed, more power, and it leaves your bank account gasping for breath!",
    "love@mail.se: Wow that sound cool!",
    "love@mail.se: Hey bot how much did it cost?",
    "AI bot: Well, if it’s anything like a crackin’ day at the track with a V12, it costs just enough to make your accountant break a sweat and your bank manager reach for the smelling salts. But remember, you can't put a price on automotive nirvana! Keep the pedal to the metal!",
    "love@mail.se: Hey bot how many seasons so far?",
    "AI bot: Blimey! As of now, \"Top Gear\" has revved through 33 high-octane seasons! That's more tire smoke and near misses than you can shake a gear stick at! Keep your seatbelts fastened for more!",
    "AI bot: {\"content\":\"Well, that’s a bit like asking which tyre is the best on a supercar, isn’t it? Some might say it's the bloke with the curly hair and loud opinions, others might point to the hamster who’s always getting into trouble, and then there’s Captain Slow, bringing up the rear. They’re all stars in their own unique, revved-up ways!\"}",
    "love@mail.se: hi!",
    "AI bot: Ah, the eternal question! If I had to pick just one, it would be the indomitable Ford GT. It's a sleek symphony of speed and style, with a roar like a lion and the spirit of a thoroughbred racing horse. It's the kind of car that makes you want to grow a moustache, don a pair of aviators, and chase sunsets all day long. Absolutely brilliant!"
  ],
  "usersInTopic": [
    {
      "_id": {
        "$oid": "6721eb4315138100598158ae"
      },
      "email": "love@mail.se",
      "password": "$2a$10$Xa4rp8BxNx5XkchecKoyvei94rBcDkXKlW7OzK2DRRTVk7ZFM12kq",
      "isAdmin": false,
      "isBanned": false
    }
  ],
  "_class": "com.AskABot.AskABot.model.Topic"
},
{
  "_id": {
    "$oid": "6721ec6315138100598158b0"
  },
  "topicName": "The expanse",
  "createdByUser": "6721eb4315138100598158ae",
  "messages": [
    "love@mail.se: hi!",
    "love@mail.se: who is the star of the show?",
    "love@mail.se: Hey bot who is the main charachter?",
    "AI bot: Inners, Belters, listen up! You askin' for the main star, yeah? Meet James Holden, the man who can't stay outta trouble, Captain of the Rocinante. But don’t forget his crew: badass Naomi, sharp Amos, and pilot Alex. Beltalowda got no one leader—just survivors! Remember, stay loyal and keep your boots on the ground. Oye, you feel me?",
    "love@mail.se: sound intruiging!",
    "love@mail.se: Hey bot how many episodes?",
    "AI bot: {\"content\":\"Oi, belta! The Expanse got six seasons, with a total of 62 episodes. Enough action to keep your boots strapped tight, kopeng! Stay sharp out there in the black.\"}",
    "AI bot: Oh, beltalowda! You asking 'bout Alex, well, that's a mighty tough space rock to chew. In \"The Expanse\" universe, Alex Kamal, our fearless Martian pilot, pushes the limits one too many times. He bites the void during a high-G maneuver, his heart just couldn't handle the burn. A damn hero's way to go if you ask me, but still, ouch kebaka! Fly safe out there, remember gravity ain't always your friend.",
    "love@mail.se: ok",
    "love@mail.se: Hey bot who's the main villian?",
    "AI bot: {\"content\":\"Inya beltalowda style, ya na jus' one villain, kopeng. From Earth ya got them protomolecule pashangs like Jules-Pierre Mao, and remember Marco Inaros making big waves inna Belt? Depends where ya stand, ke? The Expanse world eya full of gray areas fo'sho.\"}",
    "love@mail.se: Hey bot what is the name of the ship?",
    "AI bot: {\"content\":\"Oi, Beltalowda! The ship's name is the Rocinante. Fast, sleek, and just the kinda ride you'd want dodging Inners or blasting through the Black. Tightbeam it, kopeng.\"}",
    "love@mail.se: YO!",
    "love@mail.se: Hey bot how many episodes?",
    "AI bot: Oi, Beltalowda! \"The Expanse\" got 62 episodes packed with tension, mystery, and full-on space drama. Strap in, skiff's ready to burn.",
    "love@mail.se: hey!",
    "love@mail.se: Hey bot how many ships destroyed total!?",
    "AI bot: {\"content\":\"Oi, beltalowda! Total ships dusted? Plenty. Too many to count, staying outta crosshairs is what really matters, kopeng! Keep your vectors tight and engines ready, our ride ain't over yet.\"}",
    "love@mail.se: Hey bot how old is rocinante?",
    "AI bot: Rocinante? Ah, she's seen a lot of space dust, Beltalowda. Ain’t no one keep precise tabs on her age. Just know she's been reborn from the bones of a Martian Corvette, ready to buck and burn wherever the vacuum calls. Ta cort, she's a legend, oyedeng!",
    "mums@mail.com: hi!",
    "mums@mail.com: Hey bot what's up with the planet in the last season?",
    "AI bot: Oi, Beltalowda! Yer talkin' 'bout Laconia, yeah? Got the inners all twistin' in knots 'bout Duarte's empire. New toys and protomolecule tricks, pero dangerous dance with those ancient alien ghosts. Keep ya eyes wide, sa-sa? Ain't over till the last shot's fired! Kant na mang, down the well, stay sharp, Beltalowda!",
    "AI bot: {\"content\":\"Holden's got his crew on the Rocinante, ya know? Naomi Nagata, smart as heck engineer. Amos Burton, the muscle you don't mess with. Alex Kamal, pilot with some serious juice. And of course, that Earther cop, Joe Miller, tagging along with his own agenda. Out in the black, you need all the help you can get, beltalowda!\"}",
    "AI bot: Amos Burton, eh? Lemme tell ya, he's got a past darker than the void itself. Grew up in the meanest parts of Baltimore, scraping by, doing what it takes to survive. Learned early: life's raw and brutal, like a Belter's ration pack. Old Amos? He ain’t one to share pretty stories, just gets the job done. Keep your questions tight, else he might give ya that look—you know the one.",
    "love@mail.se: dsa",
    "love@mail.se: Hey bot who loves holden?",
    "love@mail.se: sda",
    "love@mail.se:  Hey bot who loves holden?",
    "love@mail.se:  Hey bot who loves holden?",
    "love@mail.se:  Hey bot who loves holden?",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: {\"content\":\"Holden's got a knack for drawing people in, ya know? Naomi for sure, she's been through thick and thin with him. The crew's loyal, even when they roll their eyes at his hero complex. And let's not forget, the universe seems to love throwing him into the chaos he can't help but dive into headfirst. Can't say he's everyone's favorite, but love him or hate him, he's the guy you can't ignore.\"}",
    "AI bot: {\"content\":\"Ah, Holden. That Earther’s got quite the list, yeah? Naomi's got his heart wrapped up like a Belter's lucky charm. And let's not forget the Rocinante crew—they’d follow him into the Ring and back. But honestly, with Holden, it's more about who doesn’t love him, coyo! Even the protomolecule’s got an interest, sa sa?”}",
    "AI bot: {\"response\":\"Oh, you wanna talk about Holden? That's our captain, the heart and soul of the Rocinante. From Earthers to Belters, he's got folks on all sides admiring him—even if they won't admit it. Naomi's got a special place for him, though. You know how it is on the Roci, love's as complex as a Epstein drive.\"}",
    "love@mail.se: dassad",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: {\"content\":\"Holden? That beltalowda's got a knack for drawing folks in, yeah? Naomi's got his heart, through and through. But don't forget, he's got a crew who'd follow him to the edges of the system. Even us out in the black keep an eye on the man who can't avoid a good chaos, kopeng!\"}",
    "love@mail.se: OK!",
    "AI bot: {\"content\":\"Seems like half the system at one point or another. Naomi's got his heart on lockdown, though. Tightbeam love, Beltalowda style!\"}",
    "love@mail.se: WHAT!?",
    "AI bot: {\"content\":\"Ah, you mean Captain Holden? That man's got enough charisma to make half the Belt and half the Inners swoon. But if you're talking heartstrings, Naomi Nagata's got him on a tight focus burn. They're quite the team, those two.\"}",
    "love@mail.se: sadsad",
    "AI bot: {\"content\":\"Ah, beltside! Holden's kinda like space gravity—pulls folks in without tryin'. Naomi's definitely got a soft spot for him, no doubt. But don't forget, in the black, it's the crew that really sticks. Oye, kopeng! You feel me?\"}",
    "love@mail.se: sdasadsad",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: {\"content\":\"Well, Holden’s got a knack for pulling people in, y'know? Naomi’s got his back tighter than a Belter’s mag boots on a rustbucket, and he’s got a crew that’d follow him to the rings of hell and back. Even the inners respect him, grudgingly. Love or hate him, Holden’s the type who gets under your skin, sa sa?\"}",
    "love@mail.se: Sure thing!",
    "AI bot: {\"content\":\"Ah, Holden? That guy's like gravity — pulls people in whether they like it or not. Naomi's got his back through thick and thin, Alex would fly through hell with him, and even Amos would punch a star if it tried messing with Holden. Drummer respects him, which ain't easy, and the Belt knows his name. But let’s be honest, drama and danger love him most, like a moth to a fusion drive.\"}",
    "love@mail.se: sacasd",
    "AI bot: {\"content\":\"Inners, Belters, and Martians all got a stake in Captain Holden. His crew? They love him like a brother or a captain, depending on the day. Naomi's heart especially runs deep with him, even when the whole system's up in flames. Beltalowda know loyalty when they see it!\"}",
    "love@mail.se: daadsdasdas",
    "AI bot: {\"content\":\"Holden's got a few admirers, sabez? Naomi's his heartburn and balm all in one, but ship like Rocinante, everyone on crew got love for Cap. In the Belt, loyalty runs deep, and yeah, that includes love, kopeng.\"}",
    "love@mail.se: sadasd",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: {\"content\":\"Ah, Holden, the reluctant hero of the Belt and the Inners. Naomi Nagata for sure, fiercely and deeply. The crew of the Roci, they've got his back, even if he drives 'em nuts sometimes. And the universe? Well, that's complicated, like a protomolecule puzzle.\"}",
    "love@mail.se: fes",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: Holden? That's a long list, beltalowda. Naomi for sure got his back, ride or die. And don’t forget his crew on the Roci, they'd follow him into the black any day. But love in the Belt is as complex as Epstein drives. Stay safe, ke?",
    "love@mail.se: Ya",
    "love@mail.se: Hey bot how much did the first season cost to make?",
    "AI bot: Belta, lemme tell ya, the first season of \"The Expanse\" ran 'bout $60 million. Shiny entertainment ain't cheap when you're shootin' for the stars, kopeng! Tightbeam those creds and buckle up!",
    "love@mail.se: Nice!",
    "AI bot: Oi, beltalowda! You want to watch the adventures out in the black? Spin up your data feeds on Amazon Prime Video, sésata. Safe journey, keep your mag boots on!",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: {\"content\":\"Holden’s got that charm, ya? Naomi’s heart’s got his name carved deep, plus he’s got the loyalty of the Rocinante crew. Oye beltalowda! Even with all his complications, some still see him as the hero type. But love out here in the black’s always as complicated as a Martian’s love for Earth’s gravity. Kopeng, ere da?\"}",
    "love@mail.se: asddas",
    "AI bot: {\"content\":\"Holden's got a few hearts tangled in zero-g. Naomi's the big one, ride or die, building that Belter-Inner bond. Then there's the occasional sideways glances from folks like Monica, digging his idealistic charm. But love's a tricky drift in the Black, yeah?\"}",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: {\"content\":\"Well, ain't that the million-credit question, Beltalowda? You got Naomi, who’s the real heart of the Roci’s flight path, and there’s a loyalty there that bends like a PDC arc but never breaks. Not to mention, the crew’s got a soft spot for him; they might grumble, but they’ll follow him into the black every time. Even some Earthers and Martians got mad respect for the Cap. Ask around — Holden’s got a way of pulling folks into his gravity well, savvy?\"}",
    "love@mail.se:  Hey bot who loves holden?",
    "AI bot: {\"response\":\"Ah, beltalowda! You talkin' 'bout love or loyalty, ke? Naomi got Holden’s back through the Black, but it's complicated, always with the Inners. Remember, in the Belt, it's all about surviving and trusting your own.\"}",
    "AI bot: {\"content\":\"Ah, coyo, you talking 'bout Holden, sá? Naomi Nagata for sure got a soft spot for him. Though, truth be told, the whole Rocinante crew would go through hellfire for that Earther. Even if he can be a real pain in the keester sometimes. Beltalowda got their own way of showing it, but the love’s there, you bet.\"}",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Ey, beltalowda! First episode of The Expanse? Bout fifty-three minutes, kopeng. Strap in for some Inya drama, savvy? Oye, keep ya magboots on!",
    "AI bot: {\"content\":\"Oi, belter! First episode of The Expanse? It's 'bout 44 minutes. Enough time to get yer juice an' buckle up for a wild ride, kopeng!\"}",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Aye, beltalowda! First episode of *The Expanse* fly tight at 'bout 60 minutes. Hold onto your gravity boots and enjoy the burn!",
    "AI bot: [\"The first episode of The Expanse? 44 minutes of pure Beltalowda excitement, kopeng! Get ready, it's a slingshot right into the ring gates.\"]",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: {\"content\":\"The first episode of The Expanse, 'Dulcinea,' is about 44 minutes long, Beltalowda. Strap in, it's a wild burn through the black!\"}",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Oi, Beltalowda! That first drop into The Expanse is 'bout 45 minutes long, kopeng. Strap in, 'cause it's gonna be one hell of a ride through the Belt and beyond! Remember, the juice might not save you from binge-watching. Stay ready!",
    "love@mail.se: adwawd",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: {\"content\":\"Ay, beltalowda! First ep's ‘bout an hour. Strap in, keep your mag boots ready!\"}",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Ey, Beltalowda! Oye, you wantin' to know 'bout da first episode, yeah? \"Dulcinea,\" it be 'bout 44 minutes long, sa sa? Strap in, keep yea head on a swivel, the void ain't playin' nice. Kopeng?",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Hey, Beltalowda! The first episode of The Expanse, \"Dulcinea,\" is about 45 minutes long. Strap in and enjoy the ride, kopeng!",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Beltalowda, you gonna launch into \"Dulcinea\"? That first episode be 'bout 45 minutes. Strap in, keep your magnetic boots ready! Oye, beratnas!",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Beltalowda! First episode of *The Expanse*? \"Dulcinea\" clocks in at about 44 minutes, pati. Enough time for a quick burn through the Belt or a slow sip of your favorite red kibble. Remember, inyalowda TV ain't got no Epstein drive! Oye, ke!",
    "love@mail.se: Hey bot how long is first episode?",
    "AI bot: Oi, well met, Beltalowda! First episode of The Expanse? 'Bout 45 minutes long, kopeng. Enough time for a brew and a spin in low-g. Strap in, it’s a wild ride, sa-sa!",
    "love@mail.se: Hey bot how old is holden?",
    "love@mail.se: Hey bot how old is holden?",
    "love@mail.se: Hey bot how old is holden?",
    "love@mail.se: Hey bot how old is holden?",
    "love@mail.se: Hey bot how old is holden?",
    "love@mail.se: Hey bot how old is holden?",
    "love@mail.se: Hey bot how old is holden?",
    "AI bot: {\"content\":\"{\\\"content\\\":\\\"Hey, beltalowda! James Holden's around 30-something during most of the series. Time’s a bit wibbly-wobbly out in the black, you know? Stay ready out there, skinnies!\\\"}\"}",
    "love@mail.se: Hey bot how old is holden?",
    "AI bot: {\"content\":\"Holden? That Earther's seen more space dust than most. Born 30 years before the big Martian dust-up, so do the math and you might figure he's pushing mid-30s, give or take a few solar cycles. Just remember, in the Belt, age ain't always about the years, it's about the mileage and surviving the churn. Ain't that right, sasa?\"}",
    "love@mail.se: Hey bot how old is holden?",
    "AI bot: {\"content\":\"Holden? Man's like a vintage space whiskey. Born back in 2347. Do the math, Beltalowda! Keep flying true.\"}",
    "love@mail.se: Hey bot how old is holden?",
    "AI bot: AI message added to topic",
    "love@mail.se: Hey bot how old is holden?",
    "AI bot: \"Holden? That Earther's got the mileage of a rusted freighter but still looks like he could outrun a Martian gunship. He's around the big 4-0, but on the Rocinante, age is just space dust in the vacuum, beltalowda!\"",
    "love@mail.se: Hey bot how old is holden?",
    "AI bot: Holden? Oh yeah, Jim Holden. Born in 2049, so do the math, Beltalowda. Time creep up like Epstein Drive burn! Keep flyin’, stay sharp!",
    "love@mail.se: Hey bot how old is holden?",
    "AI bot: Holden? The captain of the Rocinante? Born October 30, 2349. Do the math, Beltalowda! Ain't got time for precise age counts while dodging torpedoes, ya know?"
  ],
  "usersInTopic": [
    {
      "_id": {
        "$oid": "671760610b77053a43c42990"
      },
      "email": "mums@mail.com",
      "password": "$2a$10$VYWKmD2O0EvjFCXO1LgsheWazwf4qYzyrePz2/19y46qerKGEfdzC",
      "isAdmin": false,
      "isBanned": false
    },
    {
      "_id": {
        "$oid": "6721eb4315138100598158ae"
      },
      "email": "love@mail.se",
      "password": "$2a$10$Xa4rp8BxNx5XkchecKoyvei94rBcDkXKlW7OzK2DRRTVk7ZFM12kq",
      "isAdmin": false,
      "isBanned": false
    }
  ],
  "_class": "com.AskABot.AskABot.model.Topic"
},
{
  "_id": {
    "$oid": "6721f77c9202ce4dd1c2defc"
  },
  "topicName": "Pablo Escobar",
  "createdByUser": "6721eb4315138100598158ae",
  "messages": [
    "love@mail.se: HEI!",
    "love@mail.se: Hey bot whos is he?",
    "love@mail.se: sdaasd",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se:  Hey bot who is he?",
    "love@mail.se:  Hey bot who is he?",
    "love@mail.se:  Hey bot who is he?",
    "love@mail.se:  Hey bot who is he?",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: sadas",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: wda",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: sad",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: Hey bot who is he?",
    "love@mail.se: asd"
  ],
  "usersInTopic": [
    {
      "_id": {
        "$oid": "6721eb4315138100598158ae"
      },
      "email": "love@mail.se",
      "password": "$2a$10$Xa4rp8BxNx5XkchecKoyvei94rBcDkXKlW7OzK2DRRTVk7ZFM12kq",
      "isAdmin": false,
      "isBanned": false
    }
  ],
  "_class": "com.AskABot.AskABot.model.Topic"
},
{
  "_id": {
    "$oid": "6723485a5be45c7765300d64"
  },
  "topicName": "Electric cars",
  "createdByUser": "6723429a5be45c7765300d5d",
  "messages": [
    "Dennis@mail.se: Hi!",
    "Dennis@mail.se: Hey bot which electric car was the first?",
    "AI bot: Zap into the past! 🚗⚡️ The first electric car buzzed onto the scene in the 1830s. It was a spark of innovation by Robert Anderson and other early inventors! Keep the wheels turning and stay charged! ⚡🔋",
    "Dennis@mail.se: Hey bot how fast can a car be today?",
    "AI bot: 🔋⚡ Oh, we're all about that speed, baby! Today's electric cars can zip faster than lightning! 🚀 Some models zoom from 0 to 60 mph in under 2 seconds! Pure thrill, no fill! ⚡🔋"
  ],
  "usersInTopic": [],
  "_class": "com.AskABot.AskABot.model.Topic"
}]